Tekla.Structures.DrawingInternal.DelegateFake
Implements ICDelegate so that every method throws NotImplementedException.
Can be used in unit testing to mock Tekla Structures behavior, by setting
a ICDelegate instance using Tekla.Structures.DrawingInternal.CDelegateSetter.

Tekla.Structures.DrawingInternal.DelegateFake.ExportLevelMarkHandler(Tekla.Structures.DrawingInternal.dotGrLevelMark_t@)
Fake Level Mark Attributes Hander
pLevelMark: .Net Level Mark
Returns: No Return
Throws System.NotImplementedException: Not Implemented

Tekla.Structures.DrawingInternal.DelegateFake.ExportLevelMarkAttributesHandler(Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t@)
Fake Level Mark Attributes Hander
pLevelMarkAttributes: .Net Level Mark Atributes
Returns: No Return
Throws System.NotImplementedException: Not Implemented